##print("문장 선택 연산자에 대해 알아볼까요?")
##print("안녕하세요"[0])
##print("안녕하세요"[1])
##print("안녕하세요"[2])
##print("안녕하세요"[3])
##print("안녕하세요"[4])

##Python 3.13.4 (tags/v3.13.4:8a526ec, Jun  3 2025, 17:46:04) [MSC v.1943 64 bit (AMD64)] on win32
##Enter "help" below or click "Help" above for more information.
##print("""동해물과 백두산이 마르고 닳도록 
##KeyboardInterrupt
##print("""동해물과 백두산이 마르고 닳도록
##      하느님이 보우하사 우리나라 만세
##      무궁화 삼천리 화려강산 대한사람 대한으로 길이 보전하세""")
##동해물과 백두산이 마르고 닳도록
##      하느님이 보우하사 우리나라 만세
##      무궁화 삼천리 화려강산 대한사람 대한으로 길이 보전하세
##print("""동해물과 백두산이 마르고 닳도록
##      하느님이 보우하사 우리나라 만세
##      무궁화 삼천리 화려강산 대한사람
##       대한으로 길이 보전하세""")
##동해물과 백두산이 마르고 닳도록
##      하느님이 보우하사 우리나라 만세
##      무궁화 삼천리 화려강산 대한사람
##       대한으로 길이 보전하세
##print("""\동해물과 백두산이 마르고 닳도록
##      하느님이 보우하사 우리나라 만세
##      무궁화 삼천리 화려강산 대한사람
##      대한으로 길이 보전하세\
##      """)
##\동해물과 백두산이 마르고 닳도록
##      하느님이 보우하사 우리나라 만세
##      무궁화 삼천리 화려강산 대한사람
##      대한으로 길이 보전하세      
##print("안녕"+"하세요")
##안녕하세요
##print("안녕하세요"+"1")
##안녕하세요1
##print("안녕하세요"+"!")
##안녕하세요!
##print("안녕하세요"+1)
##Traceback (most recent call last):
##  File "<pyshell#15>", line 1, in <module>
##    print("안녕하세요"+1)
##TypeError: can only concatenate str (not "int") to str
##print("안녕하세요"+"1")
##안녕하세요1
##print("안녕하세요"*3)
##안녕하세요안녕하세요안녕하세요
##print(3*"안녕하세요")
##안녕하세요안녕하세요안녕하세요
##
##=========================================================== RESTART: C:/student/박서준/260930.py ===========================================================
##문장 선택 연산자에 대해 알아볼까요?
##안
##녕
##하
##세
##요
##print("안녕하세요"[1:4])
##녕하세
##print("안녕하세요"[1:3])
##녕하
##print("안녕하세요"[0:2])
##안녕
##print("안녕하세요"[2:4])
##하세
##print("안녕하세요"[1:])
##녕하세요
##print("안녕하세요"[:3])
##안녕하
##print("안녕하세요"[10])
##Traceback (most recent call last):
##  File "<pyshell#26>", line 1, in <module>
##    print("안녕하세요"[10])
##IndexError: string index out of range
##print(len("안녕하세요"))
##5
